[
    {
        "name": "Alvaro Duran",
        "bio": "I started using Python when I was a data scientist, but quickly found out that what I like the most is building software for others to use. Hence, most of the stuff I've learned over the years has to do with optimizing software from the point of view of the user.\n\nI am a developer with a unique blend of expertise in finance, software engineering, and data. When I'm building software, my mind veers towards thorough testing and expressive code. That's why I love Python!\n\nWhen not in front of the keyboard, I'm often found reading voraciously, near a pizza shop, or traveling. I may come across as too serious, but if you come bearing funny memes, or cookies, I can't help smiling.",
        "country": "Spain",
        "avatar": "img/speakers/alvaro_duran.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/alvaroduranbarata/"
        }
    },
    {
        "name": "Daniel Hervás",
        "bio": "Full-stack engineer that got his first full-time role while still being a university student thanks to self-taught Python. With a background in first, local, and later fully international/remote startups, now works as a Lead Software Engineer and main Technical Coordinator at Reckon Digital, where he collaborates primarily with the UN's World Food Programme (WFP) projects.",
        "country": "Spain",
        "avatar": "img/speakers/daniel_hervas.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/d-hervas/"
        }
    },
    {
        "name": "Eli Holderness",
        "bio": "Eli has been in tech since being released back into the wild from studying maths at university 7 years ago. They've spent their time working in industries ranging from telecoms to biotech to analog circuit design, continually getting nerd-sniped along the way. These days, they're a freelancer who speaks at conferences, runs workshops, and learns whatever they want. In their spare time, they like to play video games, knit and sew, and hang out with their cat.",
        "country": "United Kingdom",
        "avatar": "img/speakers/eli_holderness.png",
        "links": {
            "linkedin": "https://www.linkedin.com/in/eli-holderness-4890b886/"
        }
    },
    {
        "name": "Petr Viktorin",
        "bio": "I work for Python Software Foundation as CPython Deputy Core Developer in Residence.",
        "country": "Czechia",
        "avatar": "img/speakers/petr_viktorin.jpg",
        "links": {
            "github": "https://github.com/encukou/"
        }
    },
    {
        "name": "Jakub Hantabal",
        "bio": "I am a biomedical data scientist focusing on cancer research, currently studying a Master’s degree in Precision Cancer Medicine at University of Oxford. Passionate about popularization of science and educating the future generation of data scientists, I am a co-founder of Data Science Academy NGO, where we organize educational events and build a community of data enthusiasts. I am also a partner at MHG Consulting, a boutique life science consultancy focused on central European clients. I am always on the lookout for opportunities to positively impact society.",
        "country": "Slovakia",
        "avatar": "img/speakers/jakub_hantabal.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/jakub-hantabal-001898228/"
        }
    },
    {
        "name": "Laura Johanesová",
        "bio": "I am a Data Analyst and Junior Software Developer with expertise in biomedical data processing and software development for photoplethysmography analysis. Currently I am also studying at the University of Vienna. I co-founded Data Science Academy NGO and have a strong record in strategic planning, curriculum development and fostering collaborative innovation in healthcare technology.",
        "country": "Slovakia",
        "avatar": "img/speakers/laura_johanesova.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/laura-johanesov%C3%A1/"
        }
    },
    {
        "name": "Karel Boháček",
        "bio": "I am a former experimental physicist with a PhD in nuclear and particle physics. My experience lies in working on the development of advanced particle accelerators. After that, I made a transition to the banking sector, where my focus was on mathematical programming and developing predictive models for credit risks. This led me to my current field of data science, which I have always been passionate about. Currently, I work as a data scientist, specializing in ML and AI solutions for Alma Career.",
        "country": "Czechia",
        "avatar": "img/speakers/karel_bohacek.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/karel-bohacek/"
        }
    },
    {
        "name": "Jacek Kołodziej",
        "bio": "Principal Software Engineer for search/recommendations/item page at Allegro.\n\nOn the side: photographs, runs, wanders from one concert to another and from one hill to another, too. Plays drums occasionally",
        "country": "Poland",
        "avatar": "img/speakers/jacek_kolodziej.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/kolodziejj",
            "instagram": "https://www.instagram.com/unit03/",
            "last.fm": "https://www.last.fm/user/Unit03"
        }
    },
    {
        "name": "Yuliia Barabash",
        "bio": "Cloud Engineer in Nordcloud.\n\nI have lived in Germany for the past five years, during which I have gained a diverse range of experiences in the tech industry. My expertise spans from developing web applications in Python to constructing AWS cloud solutions. I have a good understanding of design patterns, Object-Oriented Programming (OOP), event-driven architecture, and microservices architectures. Additionally, I have hands-on experience with REST API design and database technologies. I am continuously committed to enhancing my skills and ensuring that I utilize tools in the best practices.\n",
        "country": "Germany",
        "avatar": "img/speakers/yuliia_barabash.png",
        "links": {
            "linkedin": "https://de.linkedin.com/in/yuliia-barabash"
        }
    },
    {
        "name": "Luboslav Lacko",
        "bio": "Zástupca šéfredaktora magazínu NEXTECH, specialista na IT, vývoj softvéru, databázové technológie, strojové učenie. Pôsobí aj ako publicista, školiteľ a konzultant. Je autorom 12  knižných publikácií vo vydavateľstvách Computerpress a Albatrosmedia a technologických zborníkov.",
        "country": "Slovakia",
        "avatar": "img/speakers/luboslav_lacko.jpg",
        "links": {
            "linkedin": "https://sk.linkedin.com/in/luboslav-lacko-ba93807"
        }
    },
    {
        "name": "Matúš Ferech",
        "bio": "Matúš is a software engineer interested in systems programming, security, and privacy.",
        "country": "Slovakia",
        "avatar": "img/speakers/matus_ferech.jpg",
        "links": {
        }
    },
    {
        "name": "Maxim Danilov",
        "bio": "Python/Django Senior Software Engineer, Solution Architect and Tech Speaker.\n\nI began my career as a programmer specializing in embedded solutions in 1997, and grow to the role of Chief Technology Officer in 2023. Through many successful projects, I gained a robust understanding of various software development paradigms. After more than 10 years as a code mentor, I finally earned the title 'Super Mentor in Engineering' in December 2023.",
        "country": "Austria",
        "avatar": "img/speakers/maxim_danilov.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/danilovmy/",
            "github": "https://github.com/danilovmy"
        }
    },
    {
        "name": "Miroslav Šedivý",
        "bio": "Using Python to make the sun shine and the wind blow. Greedy polyglot, sustainable urbanist, unicode collector, PSF Fellow.",
        "country": "Czechoslovakia",
        "avatar": "img/speakers/miro_sedivy.jpg",
        "links": {
            "twitter": "https://twitter.com/eumiro/",
            "github": "https://github.com/eumiro/",
            "linkedin": "https://linkedin.com/in/eumiro/"
        }
    },
    {
        "name": "Sara Jakša",
        "bio": "At day, I am a software engineer with the main focus on working on third party integrations for our product. At night, I like to play around with technologies connected to IndieWeb, fanfiction or analysing data to answer questions connected to my interest, let this be book reading, movie watching, personality, queer questions or more.",
        "country": "Slovenia",
        "avatar": "img/speakers/sara_jaksa.png",
        "links": {
        }
    },
    {
        "name": "Štěpán Bechynský",
        "bio": "Po skoro devíti letech opustil Štěpán Bechynsky společnost Microsoft, kde pracoval jako Technical Evangelist se zaměřením na Microsoft Azure a zakotvil v klidnějších vodách farmaceutické společnosti MSD, kde měl na starost infrastrukturu v Amazon Web Services. V klidných vodách získal titul MVP a v roce 2016 se vrátil do společnosti Microsoft, kde se staral o IoT projekty v Německu jako technický konzultant. Od roku 2020 pracuje na pozici Microsoft Technical Trainer a vzdělává zákazníky a partnery společnosti Microsoft. Volné chvíle tráví nejraději u plotny a jako koníček učí na 1. IT Gymnáziu v Praze.",
        "country": "Czechia",
        "avatar": "img/speakers/stepan_bechynsky.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/stepanbechynsky/"
        }
    },
    {
        "name": "Veronika Kabátová",
        "bio": "I'm an open source enthusiast who enjoys mentoring newbies, building communities around projects and convincing teams to do project management the right way - with documentation, testing, reliability and transparency in mind. During my ~9 years of experience in tech, I went from being a lost beginner, through a leader of a Linux kernel testing project, to a development pipeline architect. Tech work is people work, and I have more than enough experience talking to people on both sides to show for it. I'm also one of the organizers of the neighboring PyCon CZ, to give back to the amazing Python community that welcomed me when I needed it the most.",
        "country": "Czechia",
        "avatar": "img/speakers/veronika_kabatova.jpg",
        "links": {
        }
    },
    {
        "name": "Jeroen Overschie",
        "bio": "Jeroen is a Machine Learning Engineer at Xebia Data (formerly GoDataDriven), in The Netherlands. Jeroen has a background in Software Engineering and Data Science and helps companies take their Machine Learning solutions into production.\nBesides his usual work, Jeroen has been active in the Open Source community. Jeroen published several PyPi modules, npm modules, and has contributed to several large open source projects (Hydra from Facebook and Emberfire from Google). Jeroen also authored two chrome extensions, which are published on the web store.",
        "country": "Netherlands",
        "avatar": "img/speakers/jeroen_overschie.jpg",
        "links": {
            "globe": "https://jeroenoverschie.nl",
            "linkedin": "https://www.linkedin.com/in/jeroenoverschie/"
        }
    },
    {
        "name": "Marcelo Trylesinski",
        "bio": "Marcelo is a Brazilian software engineer, currently living in the Netherlands. In the last years, he has been helping the FastAPI community, and maintaining Starlette, one of the FastAPI dependencies, and Uvicorn, a web server that runs applications like FastAPI. Not long ago, he joined the recently created company Pydantic.",
        "country": "Brazil",
        "avatar": "img/speakers/marcelo_trylesinski.png",
        "links": {
            "github": "https://github.com/Kludex"
        }
    },
    {
        "name": "Tvrtko Sternak",
        "bio": "I am currently working as a Python developer at airt. In the past three years, I have gained valuable experience in the industry, including a year working on a microservice product that uses Apache Kafka for communication between services.\n\nI am a strong believer in the power of open source software, and I enjoy learning from the open source community. My interests in the field at the moment include machine learning, model deployment, Apache Kafka, and advanced Python programming.",
        "country": "Croatia",
        "avatar": "img/speakers/tvrtko_sternak.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tvrtko-sternak-152816208"
        }
    },
    {
        "name": "PyLadies Bratislava",
        "bio": "PyLadies Bratislava started in 2019 to promote, educate, and advance a diverse Python community through meet-ups and workshops.\nPyLadies Bratislava is open to everybody to join. We encourage mainly women and minorities, but everyone willing to participate is welcome.\nWe meet once a month and have fun with Python.",
        "avatar": "img/speakers/female.png",
        "links": {
        }
    },
    {
        "name": "Rudolf Starovský",
        "bio": "Rudolf is Lead Developer in Python in Zurich Insurance Company. He is responsible for development and programming in the domain of Life insurance models using mainly pandas, numpy, dask and numba.",
        "country": "Slovakia",
        "avatar": "img/speakers/rudolf_starovsky.jpg",
        "links": {
        }
    },
    {
        "name": "Jan Margeta",
        "bio": "Jan is the founder of KardioMe, a Pythonista and a white water kayaker. He is passionate about solving questions about our health with computer vision and machine learning.",
        "country": "Slovakia",
        "avatar": "img/speakers/jan_margeta.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/jmargeta"
        }
    },
    {
        "name": "Márton Kodok",
        "bio": "Márton is a Google Developer Expert on Cloud, a Champion in the Cloud Innovator program, top romanian user on Stackoverflow. Active contributor for open-source solutions like Beanstalkd console, and Riak admin interface. Conference speaker and writer about BigQuery, Cloud Run, Vertex AI.\n\n\n\nMárton Kodok is a Senior Software Architect at REEA.net, where he creates backend systems for web/mobile and contributes to design, scale and orchestrate them to serve millions of users by using Google Cloud. \n\n\n\nOutside coding, Márton hikes mountains with family, engages in civic matters, and monitors electromobility, construction, and public administration. His aspiration is relentless pursuit of knowledge.",
        "country": "Romania",
        "avatar": "img/speakers/marton_kodok.png",
        "links": {
            "globe": "https://kodokmarton.com/"
        }
    },
    {
        "name": "Tibor Kurina",
        "bio": "Tibor is a Big Data Architect with more than 20 years of experience and a lecturer in Python, Scala, Java and others.",
        "country": "Slovakia",
        "avatar": "img/speakers/tibor_kurina.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tibor-kurina-ing-phd-51794725/"
        }
    },
    {
        "name": "Elena Štefancová",
        "bio": "Elena sa 7 rokov pohybuje v rôznych oblastiach zaoberajúcich sa prácou s dátami.",
        "country": "Slovakia",
        "avatar": "img/speakers/elena_stefancova.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/elena-%C5%A1tefancov%C3%A1-8b5a01b7/"
        }
    },
    {
        "name": "Shahriyar Rzayev",
        "bio": "Senior Software Engineer @NordVPN at Nord Security.\nInterested in Security, Architecture, and Clean Code.\nLeading Azerbaijan Python User Community.",
        "country": "Slovakia",
        "avatar": "img/speakers/shahriyar_rzayev.jpg",
        "links": {
            "github": "https://github.com/ShahriyarR",
            "linkedin": "https://de.linkedin.com/in/shahriyar-rzayev"
        }
    },
    {
        "name": "Michal Kaukič",
        "bio": "Učil som hlavne matematiku, ale venoval som sa aj Linuxu, Pythonu, Open Source. Organizovali sme OSS konferencie v Žiline. Sledoval som vývoj interaktívnych nástrojov od prvopočiatkov IPythonu po Jupyterlab, lebo ich považujem za veľmi vhodné pre výučbu informatiky a programovania. Rád chodím po horách, cestujem.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_kaukic.jpg",
        "links": {
        }
    },
    {
        "name": "Mirek Biňas",
        "bio": "Odborný asistent na Katedre počítačov a informatiky, TUKE, kde učí “detiská” programovať najmä v jazyku C. \nStále dúfa, že keď vyrastie, bude z neho Linuxák. Alebo Batman.",
        "country": "Slovakia",
        "avatar": "img/speakers/mirek_binas.jpg",
        "links": {
        }
    }
]
