[
  {
    "speakers": [
      "Alvaro Duran"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Pyments: How To Design Payment Applications In Python",
    "text": "Payments are a massive part of how the world works. But most engineers know very little about it.\n\nThat’s sad, because, as more and more of business happens online, there’s an increasing demand for payment applications that are scalable, and maintainable.\n\nBesides, Python is a great programming language to build payment applications!\n\nIt is very interoperable, has a thriving open source community, and even non-engineers can contribute significantly to software built with it. In payments, readability counts, too!\n\nIn this talk, we’re going to dive deep into how to build money software effectively. You’ll learn why Python and payments are a match made in heaven, and how to leverage the language to build your own payment applications, in-house, fast, and effectively.\n\nThat way, you’ll cut some intermediaries in the process, saving your company a lot of money. It is no wonder why software engineers that can build payment applications are in high demand, they can point to their code and say “that prints money”.\n\nThe outline of the talk is:\n\nShut Up And Take My Money - Python is the Perfect Payments Language (5min)\nData-classes, Composition and A Chain of Responsibility (5-10min)\nUnification, and the Anti-corruption Layer (5min)\nHand over Fist - Debugging Payment Applications (5min)\nOutro - Every Company is a Payments Company (<5min)\n"
  },
  {
    "speakers": [
      "Daniel Hervás"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Naming: Why it's important and how to do it right",
    "text": "When reviewing PRs from junior devs, the most common issue I find isn't bad syntax or incorrect logic. It's imprecise variable names!\nThis aspect of programming, which seems unimportant or inconsequential to new programmers, is actually of extreme importance and key in the maintainability of a project.\nIn this talk, we'll go over some naming conventions, tips and best practices to make your variables and functions as self-descriptive as possible."
  },
  {
    "speakers": [
      "Eli Holderness"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Pointers? In My Python? It's More Likely Than You Think!",
    "text": "Python is a wonderful thing that takes all the complication of memory management away from us. We don’t have to worry about pre-allocating memory for our objects, or remember to free it once we’re done. So, given that we’re not doing it manually, how do these things happen? Do we have to care? Well, sometimes. Maybe.\n\nIn this talk, we’ll discuss what a pointer is, where they crop in in Python, and what you need to know in order to avoid getting tripped up by them. We’ll also cover the id of an object, why it's implemented the way it is, and why 'equal' is different from 'identical'. Finally, we’ll talk about garbage collection, what reference counting is, and how CPython knows when it’s time to get rid of unused objects.\n\nWhether you just want to understand what’s going on under the hood without having to dive into the implementation, or you’re on the hunt for some new diabolical things to do with code (self-referential lists are only the beginning!), come along to this talk and learn about the pointers in your Python.\n\nThis talk is aimed at anyone with an interest in how Python handles objects in memory, or who’s ever been confused by side-effects popping up in their code. Absolutely no knowledge of C is required, and Python beginners are extremely welcome."
  },
  {
    "speakers": [
      "Petr Viktorin"
    ],
    "type": "Talk",
    "lang": "cz",
    "title": "Python jako projekt",
    "text": "Většina z nás používá Python jako jako jazyk, ve kterém vyjádřit co je potřeba udělat, a jako nástroj který to pak udělá. Jak se ale stane, že takový Python existuje? Kdo se o něj stará? Kdo píše dokumentaci? Kde a jak se tihle lidi domlouvají? A kdyby ses chtěl/a nějakým způsobem zapojit i ty, jak na to?"
  },
  {
    "speakers": [
      "Jakub Hantabal",
      "Laura Johanesová"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Innovative data science education: The story of Data Science Academy",
    "text": "Taking the first step in learning data science in Python can be challenging. To help people overcome this fear, we co-founded Data Science Academy - an NGO providing accessible data science education focused on building a collaborative community of data enthusiasts. Over the past year, we organized two week-long bootcamps Winter Data School and Summer Data School, as well as five shorter workshops, where we show the magic of Python and inspire people to continue their programming journey.\n\nIn this talk, we will share our story of how we set up Data Science Academy, what we do, and how we motivate people to take up data science. We will discuss why quality education and focus of attendees require a physical presence of multiple lecturers, and how to make transition to Python straightforward by drawing parallels with Excel and selecting the key concepts to explain. Lastly, we will demonstrate our unique teaching materials utilizing Jupyter Notebook, and how we use them in our workshops, and how participants on our events used them to advance their careers and set up new collaborations.\n"
  },
  {
    "speakers": [
      "Karel Boháček"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Sign language recognition: Enabling communication for the hearing-impaired through machine learning",
    "text": "In this talk, our project on sign language recognition will be presented. The aim of the project is to create a prototype app that can facilitate communication between hearing-impaired individuals and those who do not know sign language. The challenges faced by hearing-impaired individuals in communicating with the general population will be discussed, and how technology can help bridge this gap will be explained.\n\nA Python code relying on Mediapipe library will be introduced, and its use in extracting key features from sign language gestures, such as hand and finger positions and movements, will be explained. The machine learning techniques used to recognize and classify these gestures will be delved into. The data preprocessing steps, model selection, and training process will be covered, as well as the evaluation metrics used to measure the accuracy of the model. Finally, the prototype will be showcased, and its operation in real-time will be\ndemonstrated. The limitations of our current approach and potential future developments in the field will also be discussed."
  },
  {
    "speakers": [
      "Jacek Kołodziej"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "GIL: What's the hassle and... should I care?",
    "text": "GIL often appears as a scary, obscure *gizmo*. Misunderstanding this aspect of Python may lead to *suboptimal architectural choices*. I invite you to see my attempt at explaining the GIL and its implications, as well as providing pointers for **how to deal with the GIL** in specific situations.\n\nThere have been (and still are), of course, attempts to get around the GIL - or *get rid of it* altogether. I hope to give some light to these works.\n\nBy providing a comprehensive overview of today's GIL in CPython, this presentation aims to help make **better design choices** - be it choosing a concurrency/parallelism model, Python implementation to use - or even whether or not to drop. Python entirely."
  },
  {
    "speakers": [
      "Yuliia Barabash"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Saying Bye to the Keyboard, Hello to Alexa with Python AWS Lambda",
    "text": "Sometimes, you sit at home and think about whether it would be possible to automate your tasks with voice instructions. For example, do I receive emails from person A, or can you summarize my day? How about doing this without opening the laptop? Thanks to Alexa you can use your voice and send commands to other applications to make it happen. The best thing is you can do this with Python! \n\nIn this session, we will teach you about the main components of Alexa, how to get started with the Developer console, and how to customize Alexa using our favorite language, Python in a serverless way. We will also demonstrate how to incorporate Alexa into your daily developer life, and you might find that, after this talk, you won't even need your keyboard — you'll just need your voice for automation.\n\nJoin us, if you are curious about constructing small and hilarious applications to break the monotony of your routine with Alexa. By the end of this session, you will learn how to do some development tricks with Alexa and how to grant your little friend Alexa's new personalized skills using Python.\n"
  },
  {
    "speakers": [
      "Luboslav Lacko"
    ],
    "type": "Talk",
    "lang": "sk",
    "title": "Ako v Pythone naprogramovať a natrénovať neurónovú sieť na generovanie textu",
    "text": "Praktická ukážka ako naprogramovať neurónovú sieť, ktorá sa natrénuje na textoch kníh a následne dokáže generovať texty. Priebežne bude vysvetlené fungovanie neurónových sietí vrátane doprednej a spätnej propagácie, aktivačných funkcií, miznúceho gradientu a podobne "
  },
  {
    "speakers": [
      "Matúš Ferech"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Nix: know what you are running, testing and deploying",
    "text": "Nix is a tool for declaring reproducible build and development environments. With Nix, you can be sure that every team member is running precisely the same application in the development, testing, and deployment environment. \n\nDo you know the issues when a new team member is trying to set up a local environment for a new project, but it just does not work? Even though you are on the same operating system, use the same application version, and all dependencies are pinned? Are some C-headers missing? Maybe you need to install some system package. Oh, and do you have the same version of the system package? Okay, let's hope we have wheels for this module. Oh no, we are building Alpine docker image, which uses musl libc instead of glibc, so no luck with wheels this time. We better include GCC. And also this and that one. What's the name of the OpenSSL for Alpine? Does it include the c headers? Great! Done! Now, let's do this dance one more time—this time in CI.\n\nThis issue will be a thing of the past with Nix. Let me show you how at my talk!"
  },
  {
    "speakers": [
      "Maxim Danilov"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Selecting tools to fight complexity in large Python projects",
    "text": "An overcomplicated project increases development and maintenance time.\nIf a complete redesign is not possible, we can try to distribute the complexity across the existing codebase. The AI assistants cannot help us with this task yet, and we should discuss manual methods and tools that can help us. The effectiveness of the proposed ideas will be demonstrated by applying them to large projects from different business areas."
  },
  {
    "speakers": [
      "Miroslav Šedivý"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Solving Two Hard Problems in Computer Science Using Pandas",
    "text": "There are 2 hard problems in computer science: cache invalidation, naming things, and off-by-1 errors. -- Leon Bambrick\n\nWhen working with timeseries representing the production data of power plants, the fundamental step is to define a good data structure. The shape of the dataframes must be a good balance between speed and memory usage to work with the right and up-to-date amount of data (cache invalidation). The parameters must have good names for fast and unambiguous identification (naming things). The time intervals must be the correct fit for observed physics to prevent mismatches (off-by-1 errors).\n\nI'll show you a few Python tricks and my experience with how I solved these problems in my projects."
  },
  {
    "speakers": [
      "Sara Jakša"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "The different types of API authentications: the stories from the trenches of third party integrations",
    "text": "APIs are one of the way we are using to communicate between different systems and services. And one of the important components of this system is figuring out, if who is trying to access it and if they are allowed to do this. In this talk I want to talk about the different types of API authentications, that I had seen in the wild as part of my work. We will go through the standard ones, like basic authentication, API Keys and OAuth, but I will also did a quick mention of digest authentication, SOAP, documentation, bit-wise magic and security and legal considerations, all with a short anecdote."
  },
  {
    "speakers": [
      "Štěpán Bechynský"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Azure OpenAI for Python developers in enterprise organizations",
    "text": "You will see how to use OpenAI in enterprise organizations. How to deploy GPT model just for your organization, how to protect it from public internet access and how to work with Python OpenAI SDK."
  },
  {
    "speakers": [
      "Veronika Kabátová"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "How to not get crazy from information overload",
    "text": "There's too many pieces of advice out there to keep them in mind and actually remember to apply them when it matters. It's tempting to become a genius overnight as the competition is harsh. But trying to become perfect and keep every piece of information in mind is overwhelming and stressful.\n\nWhere's the line between what's realistic, both as a beginner and as experienced programmer? What are some good habits to adopt right away, and how do they relate to your typical programming memes?\n\nWe'll take a look at some behaviors even experienced IT folks struggle with and how to do things instead and why, to get you a head start in your new journey."
  },
  {
    "speakers": [
      "Jeroen Overschie"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Are you ready for MLOps?",
    "text": "MLOps has survived the hype cycle and is gaining in maturity. But are we looking at MLOps for answers for the _right things_? \nNo matter how valuable MLOps can be for you, without proper building blocks in place MLOps cannot live up to its full potential. What are the prerequisites for MLOps? What parts of MLOps should you focus on? When should you even start thinking about MLOps, or when is ‘plain’ DevOps wiser to focus on first? Join us in this session to learn more!"
  },
  {
    "speakers": [
      "Tvrtko Sternak"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Decoding FastStream: A Deeper Dive into the Event Streaming Library",
    "text": "FastStream simplifies the development of services communicating over event streams such as Apache Kafka, Redis and Nats. In our talk, we introduce its origin, basics, and delve into advanced features. Past talks raised awareness; this year, we are slowly shifting focus on technical nuances—implementation details and the development environment—to inspire developers and improve open source contributions."
  },
  {
    "speakers": [
      "Rudolf Starovský"
    ],
    "type": "Talk",
    "lang": "sk",
    "title": "Knižnica Numba alebo ako zrýchliť Python?",
    "text": "Programovací jazyk Python nepatrí z pohľadu výkonnosti medzi najrýchlejšie programovacie jazyky. Ak chceme zrýchliť naše výpočty v jazyku Python, môže nám pomôcť knižnica Numba, vďaka ktorej môžeme dosiahnuť výkonnosť podobnú kompilovaným jazykom C alebo C++.\nV prednáške vysvetlíme ako funguje Python interpreter a čo je Just in time kompilácia. Pozrieme sa aké možnosti ponúka knižnica Numba a na konkrétnych príkladoch uvedieme ako vieme zrýchliť Python kód."
  },
  {
    "speakers": [
      "Jan Margeta"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Simulate, Analyze, Learn: Python's Physics Simulation",
    "text": "Join us on a journey through the world of physics simulators from Python. This talk will explore the power and versatility of various physics simulation libraries, shedding light on their applications and capabilities, in particular applied to robotics.  \nDiscover how these libraries enable scientists and enthusiasts to model and analyze real world systems. We'll delve into practical examples, simulating the world for analysis or as an environment for reinforcement learning.  \nIf you are intrigued by the marriage of code, physics and machine learning, and gain skills to simulate the wonders of the universe using Python, this talk is for you."
  },
  {
    "speakers": [
      "Márton Kodok"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Build applications with generative AI on Google Cloud",
    "text": "We will explore Vertex AI - Model Garden powered experiences, we are going to learn more about the integration of these generative AI APIs. We are going to see in action what the Gemini family of generative models are for developers to build and deploy AI-driven applications. Vertex AI includes a suite of foundation models, these are referred to as the PaLM and Gemini family of generative ai models, and they come in different versions.\nWe are going to cover how to use via API to:\n- execute prompts in text and chat\n- cover multimodal use cases with image prompts.\n- finetune and distill to improve knowledge domains\n- run function calls with foundation models to optimize them for specific tasks. \nAt the end of the session, developers will understand how to innovate with generative AI and develop apps using the generative ai industry trends."
  },
  {
    "speakers": [
      "Tibor Kurina"
    ],
    "type": "Talk",
    "lang": "sk",
    "title": "Možnosti spracovania veľkých dát (HugeData/BigData) v jayzku Python",
    "text": "V súčasnom digitálnom veku sa veľké dáta (Big Data) stávajú kľúčovou súčasťou mnohých priemyselných a vedeckých aplikácií. Táto prednáška sa zameriava na možnosti, ktoré ponúka programovací jazyk Python pri spracovaní veľkých dát. Úvodná časť poskytne prehľad o veľkých dátach, ich význame a výzvach, a prečo je Python považovaný za jeden z najvhodnejších jazykov pre ich analýzu. Budeme sa venovať kľúčovým knižniciam ako Pandas, NumPy, Polars, Dask, Modin a Vaex, ktoré sú nevyhnutné pre efektívne spracovanie dát.\n\nĎalšie sekcie sa budú zaoberať pokročilými témami ako distribuované spracovanie dát s využitím nástrojov ako Apache Spark, a integráciou Pythonu s inými platformami pre lepšiu škálovateľnosť a efektivitu. Významnú časť prednášky tvorí aplikácia Pythonu v oblasti strojového učenia a analýzy dát s praktickými ukážkami z rôznych oblastí.\n\nPrednáška tiež poukáže na najlepšie praktiky pri práci s veľkými dátami v Pythonu, ako aj na špecifické výzvy spojené so spracovaním veľkých objemov dát v reálnom čase, zabezpečením dát, a škálovateľnosťou. Na záver sa dotkneme najnovších trendov a budúceho vývoja v oblasti veľkých dát a Pythonu, čím poskytneme účastníkom prednášky ucelený pohľad na súčasný a budúci stav technológií spojených s veľkými dátami.\n\nCieľová skupina: Prednáška je určená pre odborníkov v oblasti dátových vied, programátorov, analytikov a všetkých, ktorí majú záujem o využitie Pythonu pri spracovaní a analýze veľkých dát."
  },
  {
    "speakers": [
      "Dom Weldon"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "How do imports work, and why should I care? (and why should I use a tool like PDM?)",
    "text": "ELEVATOR PITCH\nI asked myself a question: “what happens when you import something in python?” The answer was not as simple as I thought. In this talk, I’ll share what I learnt, and discuss why this is vital for security, before sharing opinions on tooling, especially the use of the Poetry alternative PDM, in 2024.\n\nABSTRACT\nPython has a rich ecosystem of open source packages available to assist with almost any conceivable requirement. Installing, using, and updating these packages should be quick, easy, and secure, however, dependency management and python packaging has historically been a source of frustration for developers, particularly with the added complications of virtual environments, and subtle differences between python versions. Furthermore, software supply chain security has attracted particular importance of late as increasing numbers of major vulnerabilities have been discovered requiring fast, sometimes immediate, mitigation.\n\nIn recent years, efforts have been made to improve packaging and dependency management in python, and we have seen the release of a number of developer tools, including Poetry, pipenv, and pipx. These work alongside pip and earlier tools such as disutils, setuptools, and easy_install, and offer higher level interfaces for developers to work with. In 2020, a new tool was released called PDM (Python Dependency Manager), and is gaining traction amongst developers in recent years.\n\nThis talk will start by giving an overview of how python imports work, before moving on to cover a brief history of package management in python, and an overview of the current state of play, and the vulnerabilities that we are exposed to by supply chain attacks. We’ll then give a brief introduction to PDM, before discussing what practical steps we can take to both improve our developer experiences, and ensure the code we write is modern, secure, and maintainable.\n\nWe’ll ask questions including some of the below.\n\n* What actually happens ‘under the hood’ when we use the import statement?\n* How many different ways can we import a package in python?\n* What does a dependency manager do, and how does it work?\n* What does a supply chain attack look like, and how do we try and stop them happening?\n\nFinally, the speaker will offer an opinionated guide to some of the best python tooling and package management setups available to python developers in 2024."
  },
  {
    "speakers": [
      "Amit Kumar"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Tackling Malaria with Python and distributed computing",
    "text": "In this talk I’ll talk about how we leveraged tools in the PyData ecosystem to be able to analyze genomics datasets containing over 100 million variants x 100 samples.\n\nIn large-scale genomics analysis pairwise distance is a common technique to reduce samples, which is a very time-expensive calculation. I will demonstrate how we solve the scaling problem in sgkit by taking pairwise distance as an example using Numba and Dask using map reduce algorithms on cpu and gpu hardware."
  },
  {
    "speakers": [
      "Mohammad Rahman"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Green Roof and Purple Roof hydraulic modeling using Python",
    "text": "Green roofs and purple roofs have emerged as sustainable strategies to mitigate urban heat island effects and manage stormwater runoff. Hydraulic modeling plays a pivotal role in understanding the performance of these roofs in retaining and managing water. This abstract delves into the utilization of Python, specifically leveraging the capabilities of NumPy and machine learning algorithms, to develop and analyze hydraulic models for green and purple roofs.\n\nThe integration of Python, a versatile programming language, with the scientific computing library NumPy, provides a powerful platform for constructing mathematical models that simulate water flow and retention characteristics of these innovative roofing systems. Through the application of machine learning algorithms, these models aim to predict and optimize the hydraulic behavior of green and purple roofs under varying conditions.\n\nIn this study, the focus lies in harnessing Python's computational prowess to implement numerical methods for simulating water flow dynamics on green and purple roofs. Utilizing NumPy's array-based computing functionalities enables efficient manipulation and calculation of large datasets, crucial for modeling complex hydraulic systems. By integrating machine learning techniques, such as regression and neural networks, with the hydraulic models, predictive capabilities are enhanced to forecast water retention, infiltration rates, and overall performance of these roofs.\n\nPython's extensibility allows for the incorporation of data collected from physical prototypes or real-world installations, facilitating the calibration and validation of the hydraulic models. Leveraging machine learning algorithms, these models adapt and improve over time with additional data, enhancing their accuracy and reliability in predicting water behavior on green and purple roofs.\n\nFurthermore, Python's visualization libraries enable the creation of graphical representations that aid in interpreting and communicating the simulation results. This visualization aspect is crucial for stakeholders, urban planners, and researchers to comprehend the hydraulic performance of green and purple roofs, fostering informed decision-making regarding their implementation and optimization.\n\nThrough the amalgamation of Python, NumPy, and machine learning techniques, this study aims to contribute to the advancement of hydraulic modeling for green and purple roofs. By harnessing the computational capabilities of Python and leveraging machine learning algorithms, the goal is to develop robust and predictive models that assist in optimizing the design, performance evaluation, and implementation of these sustainable roofing systems in urban environments.\n\nKeywords: Hydraulic modeling, Green roof, Purple roof, Python, NumPy, Machine learning, Water retention, Stormwater management, Urban sustainability."
  },
  {
    "speakers": [
      "Pavel Král"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Large Language Models Across Languages",
    "text": "My presentation, titled \"Large Language Models Across Languages\" aims to explore the fascinating world of large language models (LLMs) and their varying efficiencies in different languages.\n\nMy talk is grounded in extensive research publicly available on GitHub, providing a robust and transparent foundation for the insights shared.\n\nhttps://github.com/pavelkraleu/llm-language-tokens/tree/main\n\nKey Points of the Talk:\n* Token Economy Across Languages: An analysis of which languages require the most tokens to express the same content. This segment will dive into the tokenization process of LLMs and compare major languages on their token consumption for equivalent texts.\n* Cross-Lingual Embeddings Effectiveness: Evaluating how effectively LLMs' embeddings capture and express information across different languages. This part will focus on the quality of embeddings in bridging language gaps and maintaining semantic integrity.\n* Reasoning Abilities in Various Languages: Investigating the reasoning capabilities of LLMs when operating in multiple languages. The focus will be on comparing the models' performance across a spectrum of languages."
  },
  {
    "speakers": [
      "Vojta Filipec"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "The Beauty of Sinus And Cosinus: Hypotrochoid Curves as a Web App",
    "text": "This is a talk of a data scientist who loves to play with math, enjoys creating visualisations in Jupyter Notebook but has limited capabilities of sharing his notebooks online. I will explain what hypotrochoid curves are, how to plot them in Jupyter Notebook, then how remake a notebook into an interactive in-browser app (using ipython widgets and voila), and finally how to publish this app via Binder. I hope this will be useful for anyone who wants to share his/her notebooks with broad audience.\n\n"
  },
  {
    "speakers": [
      "Mykalin Jones"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Teaching Children Python - What Works?",
    "text": "Have you ever tried to teach your kids programming? Do you have friends trying to learn as an adult? Have you ever wondered if you would have been better off learning to code earlier in life? The push for more people to learn to code has caused an explosion in the educational industry. Boot camps and certification programs of dramatically varying quality have emerged in nearly every corner of the world. These programs are often accompanied by lofty claims and promises. Children have been no exception to this, as more and more companies attempt to capitalize on the claim that children should start learning early because it's \"like learning a language\". However, research suggests that this might not be the most solid argument. What benefits are there in teaching them early? How do children acquire programming knowledge? How does our language around the concepts affect their understanding? Can the answer to these questions inform how we teach adults coming in from non-STEM fields? This talk will focus on these questions by presenting the current data we have, in conjunction with anecdotal evidence from sessions with children who code in Python."
  },
  {
    "speakers": [
      "Peter Steiner"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Data Engineering Story",
    "text": "From Data Engineering at Takeda to Revolutionizing Real Estate Search: A Journey of Innovation and Impact.\n\nJoin me on an inspiring journey that traces my evolution from a Data Engineer at Takeda to the founder of a successful real estate search startup \"Realitymap.sk\" with a thriving user base. In this presentation, I will share key milestones, challenges, and lessons learned during my transformational experience in the world of data engineering.\n\nWe'll delve into the intricacies of my work at Takeda, where I honed my skills in data processing, integration, and analysis. Discover how these foundational experiences laid the groundwork for my entrepreneurial venture into the real estate tech landscape.\n\nThe narrative will unfold as I navigate the dynamic landscape of data, engineering, and entrepreneurship. Learn about the pivotal moments that shaped my approach to problem-solving, innovation, and collaboration, ultimately leading to the creation of Realitymap.sk that has captured the attention of thousands of users."
  },
  {
    "speakers": [
      "Peter Bakonyi"
    ],
    "type": "Talk",
    "lang": "en",
    "title": "Pythonic Outliers: Mastering LOF Detection",
    "text": "Join us for an insightful talk that delves into the fundamentals of leveraging the Local Outlier Factor (LOF) algorithm in Python for anomaly detection. \n\nAnomalies, or outliers, in datasets can hold crucial information yet often remain elusive without proper tools. This presentation aims to demystify the concept of LOF and equip attendees with the knowledge to effectively identify and interpret local outliers in their own datasets.\n\nThe talk will commence with a brief overview of the theoretical underpinnings of LOF, shedding light on its ability to detect anomalies by comparing the local density of data points. We will explore the nuances of LOF, emphasizing its capacity to capture anomalies that might be overlooked by traditional methods.\nWe'll provide an overview of the steps involved and share practical insights into integrating LOF into data analysis workflows.\n\nThe talk will conclude by outlining considerations for parameter tuning and interpreting LOF results, providing attendees with a foundational understanding of how to apply LOF effectively in their data exploration endeavors.\n\n\nBy the end of the talk, attendees will have a solid understanding of the basics of LOF, its significance in anomaly detection, and the proficiency to apply this algorithm in Python. Whether you are a beginner seeking an introduction to outlier detection or an experienced practitioner looking to enhance your toolkit, this presentation promises to be a valuable exploration into the realm of local outlier factors."
  },
  {
    "speakers": [
      "PyLadies Bratislava"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "Introduction to Automation and Scripting: A Beginner's Workshop in Python",
    "text": "Unlock the power of automation and scripting with our beginner-friendly workshop in Python. This hands-on session introduces participants to fundamental Python programming, automation concepts, and essential scripting skills. Ideal for beginners, this workshop empowers individuals to embark on their own scripting journey."
  },
  {
    "speakers": [
      "Jakub Hantabal",
      "Laura Johanesová"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "Uncovering patterns in a dataset via data visualization and accessible machine learning",
    "text": "In this workshop, we will learn how to gain insight into a dataset. We will use a dataset that everyone can relate to - Pokemon! This workshop will be entirely practical - you will code along with us in a Jupyter notebook. We will be explaining the theory and rationale behind what code we write along the way, and the audience are encouraged to ask questions along the way.\n\nWe will simulate the job of a real-world data analyst who is tasked with investigating a question: Does higher health correlate with a better attack?\n\nTo accomplish this, we will progress through the dataset from basic cleanup all the way to fitting a machine learning model. We will first clean and filter the dataset, and determine if the data is even usable. Here, we will learn how to evaluate the quality of the data (summary statistics, missing values and what to do with them (imputation), data distribution etc). We will look into the HP and Attack data and ascertain if what we’re given is sufficient to answer our question. Can we add another feature to these two? We’ll also look at additional feature selection.\n\nWe will then progress to data visualization - we’ll touch on which plot to use for which purpose and learn their syntax in Python (Histogram, scatter plot, correlation plot, box and whisker plot + violin plot, hist and rug plot). We will visualize the data in multiple ways.\n\nConcluding the workshop, we will move on to simple machine learning - you will be introduced to supervised learning, classification and regression. We will discuss how to choose the right model to train and look at applying regression models (linear regression) and classification models (logistic regression, random forest) to our dataset. We will measure the performance of these models, and draw conclusions from their outputs.\n\nBy the end of the workshop, we will answer the initial question, as well as gain insights into the Pokemon dataset, realising how powerful Python is in accessible data analysis."
  },
  {
    "speakers": [
      "Jeroen Overschie"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "How to MLOps: Experiment tracking & deployment",
    "text": "What's this thing called **MLOps**? You may have heard about it by now, but never really understood what all the fuzz is about. Let's find out together!\n\nIn this tutorial, you will learn about MLOps and take your first steps in a hands-on way. To do so, we will be using **Open Source** tooling. We will be taking a simple example of Machine Learning use case and will gradually make it more ready for production 🚀.\n\nWe start with a simple time-series model in Python using scikit-learn and first add logging steps to make the performance of the model measurable. Don't worry: we will go through it step-by-step, so you won't be overwhelmed. Then, we will log our ML model and load it back into an inference step. Lastly, we will learn about deploying these actual models by Dockerizing our application 🙏."
  },
  {
    "speakers": [
      "Štěpán Bechynský"
    ],
    "type": "Workshop",
    "lang": "cz",
    "title": "Micro:bit a Python",
    "text": "Přijďte s vlastním laptopem, já vám půjčím Micro:bit a sami si vyzkoušíte práci s fyzickým hardware, který podporuje Python. Workshop je vhodný zejména pro učitele a lektory v kroužcích mládeže. Uvidíte, jak učit Python jinak."
  },
  {
    "speakers": [
      "Elena Štefancová"
    ],
    "type": "Workshop",
    "lang": "sk",
    "title": "Mám dáta, čo s nimi?",
    "text": "Prehľad vhodných Python knižníc pre úplné začiatky práce s dátami."
  },
  {
    "speakers": [
      "Maxim Danilov"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "Creating really Multilingual Django project in few steps.",
    "text": "In this talk, we can go together through all the milestones needed to create a truly multilingual Django Project in 120 minutes. This includes the translation of static texts for both front end and back end, adjustments for dynamic data translations, and translations of graphical elements. Finally, I will demonstrate how to adapt a multilingual project for various cultures and writing styles."
  },
  {
    "speakers": [
      "Shahriyar Rzayev"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "Score A+ for Security Headers with Django application",
    "text": "The tutorial will focus on developing a Django application that utilizes ReadOnce objects, ensuring secrets can only be accessed once before being permanently deleted. Additionally, the workshop will guide attendees through the best practices for achieving an A+ rating in security headers checks, a crucial aspect of web application security. By the end of this session, participants will have hands-on experience in enhancing the security and maintainability of Django projects, crucial skills for any Python developer."
  },
  {
    "speakers": [
      "Michal Kaukič",
      "Mirek Biňas"
    ],
    "type": "Workshop",
    "lang": "sk",
    "title": "Dátová analytika ako predjedlo",
    "text": "Veľa je dát na svete, všetky o niečom hovoria, ak sa k nim prihliadneme. Vybrali sme údaje o taxikároch v New Yorku a budeme ich spolu pojedať na tácke Jupytera, s polars namiesto noža a vidličky. Lepšie raz vidieť, ako veľa ráz počuť, preto budeme kresliť čo sa dá, aj čo veľmi nie :-) Pomôže nám pritom plotly. Aby sme sa len my sami netešili, urobíme nakoniec webovú aplikáciu (pyviz panel), ktorú si môžu pozrieť aj iní. Život nestojí - objavilo sa marimo, veľmi zaujímavá alternatíva pre dátové webové aplikácie. Ukážka, ako by mohlo vyzerať to, čo vytvoríme je na http://feelmath.eu:2025." 
  },
  {
    "speakers": [
      "Pavel Král"
    ],
    "type": "Workshop",
    "lang": "en",
    "title": "Creating a RAG tool in Python",
    "text": "In this workshop we will have a hands-on experience with creating a simple RAG (Retrieval-Augmented Generation) tool in Python. We will use the OpenAI API to calculate embeddings and integrate with GPT.\n\nWe will learn about the following topics:\n- Tokenization basics: what are tokens and why are they important\n- Embeddings: How they work and their importance in the context of machine learning\n- Searching for similar documents: Techniques and methods for effective search\n- Generating new content: How to generate content based on found documents\n\nWe will also look at the specifics of LLM (Large Language Models) models and their different behaviors when working with different languages. I have elaborated on this topic in detail in my project, which is available on Github.\n\nhttps://github.com/pavelkraleu/llm-language-tokens/tree/main"
  },
  {
    "speakers": [
      "Tomáš Pulai"
    ],
    "type": "Workshop",
    "lang": "sk",
    "title": "AsyncSocket Mastery",
    "text": "Workshop ponúka pohľad do sveta asynchrónneho programovania v jazyku Python, s dôrazom na modul asyncio a prácu s TCP/IP socketmi.\nÚčastníci sa naučia:\n- základy asynchrónneho programovania\n- jeho výhody pri manipulácii so sieťovými soketmi\n\nHlavnou časťou workshopu budú praktické cvičenia, kde účastníci implementujú asynchrónne TCP/IP aplikácie (serverovské aj klientské) pomocou modulu asyncio."
  },
  {
    "speakers": [
      "Michal Brandis"
    ],
    "type": "Talk",
    "lang": "sk",
    "title": "Analýza freelance trhu. Trendy, štatistiky a prehľad v IT projektoch",
    "text": "Všimli ste si, ako často recruiteri nerozumejú IT? Nevedia vám poriadne vysvetliť, akú pracovnú pozíciu ponúkajú, spätná väzba po pohovore sa postupne stáva sci-fi fenoménom a keď už sa vám konečne podarí získať nový projekt, mnohí z vás zaň nedostanú ani férové finančné ohodnotenie? Alebo vám klienti dokonca nezaplatia včas?\n\nPred takmer jedenástimi rokmi sa dvaja ostrieľaní ajťáci rozhodli vydláždiť pre IT špecialistov novú cestu, ktorá by sa odlišovala osobným a odborne fundovaným prístupom. Tú si do dnešného dňa zvolilo viac ako 29-tisíc freelancerov, od konzultantov cez programátorov, testerov, analytikov až po manažérov, ktorí získavajú špičkové projekty. Dá sa povedať, že značka TITANS ovládla trh outsourcingu IT špecialistov na Slovensku. \n\nPrieskumy uvádzajú, že IT oddelenia rozširuje čoraz menej úspešných firiem. Efektívnejší je pre ne dynamický prenájom tímu. Predstavím vám dôvody, pre ktoré toľkí ajťáci prechádzajú na breh freelancingu a faktory, ktoré vám pomôžu zistiť, či je to pre vás vhodná cesta. Dozviete sa viac o vývoji trhu, odvetviach s najväčším množstvom projektov, finančnom ohodnotení a tiež o špecializáciách, ktoré sú najžiadanejšie na IT projektoch. Na záver vám priblížim rozličné formy spolupráce s klientmi, priemerný čas, ktorí naši Titani strávia na projektoch, a praktický rozdiel medzi živnosťou a sro-čkou."
  }
]
